; domain
(define (domain spanner)                    
(:requirements :typing :strips :constraints)      

(:types 
	location locatable - object
	man nut spanner - locatable	
)                                           
                                                                               
(:predicates 
	(at ?m - locatable ?l - location)
	(carrying ?m - man ?s - spanner)
	(useable ?s - spanner)
	(link ?l1 - location ?l2 - location)
	(tightened ?n - nut)
	(loose ?n - nut))                                                                                           
(:action walk 
        :parameters (?start - location ?end - location ?m - man)
        :precondition (and (at ?m ?start) 
                           (link ?start ?end))                                                          
        :effect (and (not (at ?m ?start)) (at ?m ?end)))

(:action pickup_spanner 
        :parameters (?l - location ?s - spanner ?m - man)
        :precondition (and (at ?m ?l) 
                           (at ?s ?l))
        :effect (and (not (at ?s ?l))
                     (carrying ?m ?s)))

(:action tighten_nut 
        :parameters (?l - location ?s - spanner ?m - man ?n - nut)
        :precondition (and (at ?m ?l) 
		      	   (at ?n ?l)
			   (carrying ?m ?s)
			   (useable ?s)
			   (loose ?n))
        :effect (and (not (loose ?n))(not (useable ?s)) (tightened ?n)))
)

; problem
(define (problem spanner-8-7-12-8001)
 (:domain spanner)
 (:objects 
     bob - man
     spanner1 spanner2 spanner3 spanner4 spanner5 spanner6 spanner7 spanner8 - spanner
     nut1 nut2 nut3 nut4 nut5 nut6 nut7 - nut
     location1 location2 location3 location4 location5 location6 location7 location8 location9 location10 location11 location12 - location
     shed gate - location
    )
 (:init 
    (at bob shed)
    (at spanner1 location10)
    (useable spanner1)
    (at spanner2 location10)
    (useable spanner2)
    (at spanner3 location12)
    (useable spanner3)
    (at spanner4 location5)
    (useable spanner4)
    (at spanner5 location4)
    (useable spanner5)
    (at spanner6 location10)
    (useable spanner6)
    (at spanner7 location11)
    (useable spanner7)
    (at spanner8 location7)
    (useable spanner8)
    (loose nut1)
    (at nut1 gate)
    (loose nut2)
    (at nut2 gate)
    (loose nut3)
    (at nut3 gate)
    (loose nut4)
    (at nut4 gate)
    (loose nut5)
    (at nut5 gate)
    (loose nut6)
    (at nut6 gate)
    (loose nut7)
    (at nut7 gate)
    (link shed location1)
    (link location12 gate)
    (link location1 location2)
    (link location2 location3)
    (link location3 location4)
    (link location4 location5)
    (link location5 location6)
    (link location6 location7)
    (link location7 location8)
    (link location8 location9)
    (link location9 location10)
    (link location10 location11)
    (link location11 location12)
)
 (:goal
  (and
   (tightened nut1)
   (tightened nut2)
   (tightened nut3)
   (tightened nut4)
   (tightened nut5)
   (tightened nut6)
   (tightened nut7)
)))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 7
2. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 7
3. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 0 of 7
4. (walk location3 location4 bob)
   deleted: (at bob location3)
   added: (at bob location4)
   goals met: 0 of 7
5. (walk location4 location5 bob)
   deleted: (at bob location4)
   added: (at bob location5)
   goals met: 0 of 7
6. (pickup_spanner location5 spanner4 bob)
   deleted: (at spanner4 location5)
   added: (carrying bob spanner4)
   goals met: 0 of 7
7. (walk location5 location6 bob)
   deleted: (at bob location5)
   added: (at bob location6)
   goals met: 0 of 7
8. (walk location6 location7 bob)
   deleted: (at bob location6)
   added: (at bob location7)
   goals met: 0 of 7
9. (pickup_spanner location7 spanner8 bob)
   deleted: (at spanner8 location7)
   added: (carrying bob spanner8)
   goals met: 0 of 7
10. (walk location7 location8 bob)
   deleted: (at bob location7)
   added: (at bob location8)
   goals met: 0 of 7
11. (walk location8 location9 bob)
   deleted: (at bob location8)
   added: (at bob location9)
   goals met: 0 of 7
12. (walk location9 location10 bob)
   deleted: (at bob location9)
   added: (at bob location10)
   goals met: 0 of 7
13. (pickup_spanner location10 spanner1 bob)
   deleted: (at spanner1 location10)
   added: (carrying bob spanner1)
   goals met: 0 of 7
14. (pickup_spanner location10 spanner2 bob)
   deleted: (at spanner2 location10)
   added: (carrying bob spanner2)
   goals met: 0 of 7
15. (pickup_spanner location10 spanner6 bob)
   deleted: (at spanner6 location10)
   added: (carrying bob spanner6)
   goals met: 0 of 7
16. (walk location10 location11 bob)
   deleted: (at bob location10)
   added: (at bob location11)
   goals met: 0 of 7
17. (pickup_spanner location11 spanner7 bob)
   deleted: (at spanner7 location11)
   added: (carrying bob spanner7)
   goals met: 0 of 7
18. (walk location11 location12 bob)
   deleted: (at bob location11)
   added: (at bob location12)
   goals met: 0 of 7
19. (pickup_spanner location12 spanner3 bob)
   deleted: (at spanner3 location12)
   added: (carrying bob spanner3)
   goals met: 0 of 7
20. (walk location12 gate bob)
   deleted: (at bob location12)
   added: (at bob gate)
   goals met: 0 of 7
21. (tighten_nut gate spanner1 bob nut7)
   deleted: (loose nut7) (useable spanner1)
   added: (tightened nut7)
   goals met: 1 of 7
22. (tighten_nut gate spanner2 bob nut6)
   deleted: (loose nut6) (useable spanner2)
   added: (tightened nut6)
   goals met: 2 of 7
23. (tighten_nut gate spanner3 bob nut5)
   deleted: (loose nut5) (useable spanner3)
   added: (tightened nut5)
   goals met: 3 of 7
24. (tighten_nut gate spanner4 bob nut4)
   deleted: (loose nut4) (useable spanner4)
   added: (tightened nut4)
   goals met: 4 of 7
25. (tighten_nut gate spanner6 bob nut3)
   deleted: (loose nut3) (useable spanner6)
   added: (tightened nut3)
   goals met: 5 of 7
26. (tighten_nut gate spanner7 bob nut2)
   deleted: (loose nut2) (useable spanner7)
   added: (tightened nut2)
   goals met: 6 of 7
27. (tighten_nut gate spanner8 bob nut1)
   deleted: (loose nut1) (useable spanner8)
   added: (tightened nut1)
   goals met: 7 of 7
